In [2]:
import pandas as pd
from pandas import Series

In [3]:
arr = Series(["Mango", "Apple", "Peach", "Kiwi"])
print(arr)

0    Mango
1    Apple
2    Peach
3     Kiwi
dtype: object

In [6]:
arr = Series(["Mango", "Apple", "Peach", "Kiwi"])
print(f"The Index values are : {arr.index}")
print(f"The Values as per index are : {arr.values}")

The Index values are : RangeIndex(start=0, stop=4, step=1)
The Values as per index are : ['Mango' 'Apple' 'Peach' 'Kiwi']

In [9]:
arr = Series(["Mango", "Apple", "Peach", "Kiwi"], index= ["M", "A", "P", "K"])
print(arr)

M    Mango
A    Apple
P    Peach
K     Kiwi
dtype: object

In [10]:
import numpy as np

In [14]:
arr = Series(np.arange(3), index = ["a", "b", "c"])
print(arr)
arr.index = ["A", "B", "C"] #assigning new index to the series
print(arr)

a    0
b    1
c    2
dtype: int32
A    0
B    1
C    2
dtype: int32

In [20]:
dict1 = {"A":"Apple", "B":"Banana", "C": "Cat", "D": "Drum"}
arr = Series(dict1)
n = ["A", "B", "C", "D","e"]
arr.index = ["a", "b", "c", "d"]
arr1 = Series(dict1,index = n)
print(arr)
print(arr1)

a     Apple
b    Banana
c       Cat
d      Drum
dtype: object
A     Apple
B    Banana
C       Cat
D      Drum
e       NaN
dtype: object

In [21]:
print(arr[0])

Apple

In [22]:
pd.isnull(arr1)

A    False
B    False
C    False
D    False
e     True
dtype: bool

In [23]:
pd.notnull(arr1)

A     True
B     True
C     True
D     True
e    False
dtype: bool

In [26]:
arr1 = Series(np.arange(5))
print(arr1)
print(arr1 * 2)

0    0
1    1
2    2
3    3
4    4
dtype: int32
0    0
1    2
2    4
3    6
4    8
dtype: int32

In [31]:
arr1[arr1 > 2]

3    3
4    4
dtype: int32

In [32]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [35]:
table = [[1, "Adam"], [2, "Mike"], [3,"Rahul"], [4, "Ronit"]]
df = pd.DataFrame(table)
print(df)

   0      1
0  1   Adam
1  2   Mike
2  3  Rahul
3  4  Ronit

In [39]:
names = ["John", "Mike", "Rahul", "Ronit"]
ages = [25, 45, 43, 30]
profession = ["Developer", "Manager", "Tester", "Team Lead"]
salaries = [100000, 500000, 80000, 300000]
dict1 = {'Name':names, "Age": ages, "Profession":profession, "Salaries": salaries}
df = pd.DataFrame(dict1)
print(df)

    Name  Age Profession  Salaries
0   John   25  Developer    100000
1   Mike   45    Manager    500000
2  Rahul   43     Tester     80000
3  Ronit   30  Team Lead    300000

In [43]:
df1 = pd.DataFrame(dict1, columns= ["Name", "Profession", "Salaries", "Age"])
print(df1)

    Name Profession  Salaries  Age
0   John  Developer    100000   25
1   Mike    Manager    500000   45
2  Rahul     Tester     80000   43
3  Ronit  Team Lead    300000   30

In [60]:
df1 = pd.DataFrame(dict1, index= ['J','M',"R", "R"])
print(df1)

    Name  Age Profession  Salaries
J   John   25  Developer    100000
M   Mike   45    Manager    500000
R  Rahul   43     Tester     80000
R  Ronit   30  Team Lead    300000

In [61]:
df1 = df1.set_index("Name") #index setting of same column can be done only one time
print(df1)

       Age Profession  Salaries
Name
John    25  Developer    100000
Mike    45    Manager    500000
Rahul   43     Tester     80000
Ronit   30  Team Lead    300000

In [70]:
df1.shape
df1.values[1][1] #will give manager

'Manager'

In [71]:
df1.index.name = "Employee Name"
df1

               Age Profession  Salaries
Employee Name
John            25  Developer    100000
Mike            45    Manager    500000
Rahul           43     Tester     80000
Ronit           30  Team Lead    300000

In [72]:
df1.dtypes

Age            int64
Profession    object
Salaries       int64
dtype: object

In [79]:
df1.describe()

             Age       Salaries
count   4.000000       4.000000
mean   35.750000  245000.000000
std     9.776673  196892.525675
min    25.000000   80000.000000
25%    28.750000   95000.000000
50%    36.500000  200000.000000
75%    43.500000  350000.000000
max    45.000000  500000.000000

In [81]:
df1[["Age", "Salaries"]]

               Age  Salaries
Employee Name
John            25    100000
Mike            45    500000
Rahul           43     80000
Ronit           30    300000

In [83]:
df1[0:2] #first 2 rows

               Age Profession  Salaries
Employee Name
John            25  Developer    100000
Mike            45    Manager    500000

In [88]:
df1 = pd.DataFrame(dict1, columns= ["Name", "Profession", "Salaries", "Age"])

df1 = pd.DataFrame(dict1, index= ['J','M',"R", "R"])
print(df1)

    Name  Age Profession  Salaries
J   John   25  Developer    100000
M   Mike   45    Manager    500000
R  Rahul   43     Tester     80000
R  Ronit   30  Team Lead    300000

In [100]:
print(df1.loc[['J','R']])
print(df1.loc['J'][0])

    Name  Age Profession  Salaries
J   John   25  Developer    100000
R  Rahul   43     Tester     80000
R  Ronit   30  Team Lead    300000
John

In [93]:
df2 = df1.iloc[0:2]

In [94]:
df2

   Name  Age Profession  Salaries
J  John   25  Developer    100000
M  Mike   45    Manager    500000